package lesson16.jojo;

/**
 * Клас `StandGenerator` генерує ім'я та характеристики Стенду для Джо Джо за допомогою випадкового вибору.
 */
public class StandGenerator {
    public static void main(String[] args) {

        /*Наш Джо Джо вже в 2 роки отримав свій перший стенд!
        Допоможи нам створити його ім'я та характеристики.
        Все, як завжди, зробимо це за допомогою загадкового методу вибору випадкових елементів.
        Ось завдання для тебе:
        1) Спробуй згенерувати ім'я для Стенду нашого Джо Джо.
        Використай випадковий вибір імен із попереднього коду.
        Ім'я Стенду повинно бути одним із імен із масиву standNames.

        2) Тепер давай надамо нашому Стенду особливу характеристику.
        Використай випадковий вибір характеристик із масиву abilities.
        Виведи ім'я та характеристику Стенду на екран.

        Очікуваний вивід:
        Ім'я Стенду для Джо Джо: Золота Стріла
        Характеристика Стенду: Маніпуляція реальністю


        */

        // Масиви для генерації імен Стендів (допиши свої варіанти!)
        String[] standNames = { "Золота Стріла", "Стар Платіна"};

        // Масиви для генерації характеристик Стендів (допиши свої варіанти!)
        String[] abilities = { "Часовий зупин", "Маніпуляція реальністю"};

    }
}
